<template>
  <section class="how-works">
    <div class="wrap how-works__wrap">
      <div class="how-works__ellipse-light" />
      <div class="how-works__inner">
        <h2 class="title title_h2 colored-el how-works__title">
          как будем работать
          <BaseLine
            path="how-works/divide-line-how-works"
            class="how-works__divide-line"
          />
        </h2>
        <div class="how-works__cards">
          <HowWorksCard
            v-for="(info, i) in infos"
            :key="i"
            :number="i + 1"
            :period="info.period"
            :text="info.text"
            :infos="info.infos"
          />
        </div>
        <BaseButton class="how-works__button" />
      </div>
    </div>
  </section>
</template>

<script lang="js">
import BaseLine from "@/components/Base/BaseLine.vue";
import HowWorksCard from "@/views/Home/components/HowWorks/HowWorksCard.vue";
import BaseButton from "@/components/Base/BaseButton.vue";

export default {
  name: 'HowWorks',
  components: { BaseButton, HowWorksCard, BaseLine },
  data: () => ({
    infos: [
      {
        period: '1 день',
        text: 'Бесплатная диагностика текущего состояния компании',
        infos: [ 'Узнаете, на каком уровне технологического прогресса находится ваша компания сегодня',
          'Поймете, нужна ли вам автоматизация и в каком объеме',
          'Заберете ценные материалы от наших экспертов для увеличения эффективности работы уже завтра без кардинальных изменений' ]
      },
      {
        period: 'до 2 недель',
        text: 'Глубокий аудит компании методологом',
        infos: [ 'Узнаете, на каком уровне технологического прогресса находится ваша компания сегодня',
          'Поймете, нужна ли вам автоматизация и в каком объеме',
          'Заберете ценные материалы от наших экспертов для увеличения эффективности работы уже завтра без кардинальных изменений' ]
      },
      {
        period: '1 - 2 недели',
        text: 'Написание технического задания на разработку модулей методологом',
        infos: [ 'Узнаете, на каком уровне технологического прогресса находится ваша компания сегодня',
          'Поймете, нужна ли вам автоматизация и в каком объеме',
          'Заберете ценные материалы от наших экспертов для увеличения эффективности работы уже завтра без кардинальных изменений' ]
      },
      {
        period: 'period',
        text: 'period',
        infos: [ 'Узнаете, на каком уровне технологического прогресса находится ваша компания сегодня',
          'Поймете, нужна ли вам автоматизация и в каком объеме',
          'Заберете ценные материалы от наших экспертов для увеличения эффективности работы уже завтра без кардинальных изменений' ]
      },
      {
        period: '1 день',
        text: 'Заключение договора',
        infos: [ 'Узнаете, на каком уровне технологического прогресса находится ваша компания сегодня',
          'Поймете, нужна ли вам автоматизация и в каком объеме',
          'Заберете ценные материалы от наших экспертов для увеличения эффективности работы уже завтра без кардинальных изменений' ]
      },
      {
        period: 'до 5 дней',
        text: 'Встреча с программистом STAP',
        infos: [ 'Узнаете, на каком уровне технологического прогресса находится ваша компания сегодня',
          'Поймете, нужна ли вам автоматизация и в каком объеме',
          'Заберете ценные материалы от наших экспертов для увеличения эффективности работы уже завтра без кардинальных изменений' ]
      },
      {
        period: '1 - 3 месяца',
        text: 'Интеграция готовых модулей в вашу компанию',
        infos: [ 'Узнаете, на каком уровне технологического прогресса находится ваша компания сегодня',
          'Поймете, нужна ли вам автоматизация и в каком объеме',
          'Заберете ценные материалы от наших экспертов для увеличения эффективности работы уже завтра без кардинальных изменений' ]
      },
      {
        period: 'бессрочно',
        text: 'Посттехническая поддержка функционирования модулей',
        infos: [ 'Узнаете, на каком уровне технологического прогресса находится ваша компания сегодня',
          'Поймете, нужна ли вам автоматизация и в каком объеме',
          'Заберете ценные материалы от наших экспертов для увеличения эффективности работы уже завтра без кардинальных изменений' ]
      },
      {
        period: 'бессрочно',
        text: 'Сопровождение методологом по работе с установленными модулями',
        infos: [ 'Узнаете, на каком уровне технологического прогресса находится ваша компания сегодня',
          'Поймете, нужна ли вам автоматизация и в каком объеме',
          'Заберете ценные материалы от наших экспертов для увеличения эффективности работы уже завтра без кардинальных изменений' ]
      },
    ]
  })
}
</script>

<style lang="scss">
.how-works {
  padding: 0 0 77px;

  &__wrap {
    position: relative;
  }

  &__ellipse-light {
    position: absolute;
    z-index: -1;
    left: -110px;
    bottom: -70px;
    width: 725px;
    height: 725px;
    border-radius: 50%;
    border: 1px solid var(--color-bg-dark);
    opacity: 0.2;
    background: #467792;
    filter: blur(150px);
  }

  &__inner {
    padding: 45px 43px 61px;
    background-image: url(~@/assets/img/how-works/bg.svg);
    background-size: cover;
    background-repeat: no-repeat;
    background-position: top;
  }

  &__title {
    position: relative;
    margin-bottom: 47px;
  }

  &__divide-line {
    z-index: 1;
  }

  &__cards {
    display: grid;
    grid-template-columns: repeat(3, 1fr);
    gap: 62px 53px;
    margin-bottom: 62px;
  }

  &__button {
    position: relative;
    left: 50%;
    transform: translateX(-50%);
  }
}
</style>
